module.exports = {
	GREETINGS: "Привет 👋\n"
		+ "Я binary автотест 🤖.\n"
		+ "Я буду проверять правильно ли реализована функциональная часть приложения.\n\n"
		+ "Давай пройдёмся по списку 📔\n",
	UNIT_TESTS: 'Сперва проверим unit тесты:',
	CODE_STYLE: 'А теперь, посмотрим на твой код:',
	CODE_STYLE_IS_NOT_GOOD: 'Что-то твой код выглядит не очень хорошо. Проверь, пожалуйста, следующие файлы:',
	CODE_STYLE_IS_GOOD: 'Отлично, твой код написан согласно PSR-12, так держать.',

	FINAL_WORDS: 'Ну что ж, ты набрал ${score} 🦜. И это ',
	BEST_RESULT: 'отличный результат 🎉 ',
	GOOD_RESULT: 'неплохой результат 👍 Но есть еще, что улучшить 🛠️',
	BAD_RESULT: 'так себе результат 🤷 Попробуй улучшить если еще есть время и попытки 🛠️',
	FINAL: 'Теперь жди, когда Binarian проверит твою работу и поставит финальную оценку ☠️',

	REPORT_ERROR: 'Что-то пошло не так 🛠️ Тестовий репорт не сгенерировался.',
	CODE_STYLE_REPORT_ERROR: 'Что-то пошло не так 🛠️ Code style репорт не сгенерировался.',
	SOMETHING_WENT_WRONG: 'Что-то пошло не так 🛠️'
};