module.exports = {
	GREETINGS:  "Привіт 👋\n"
		+ "Я binary автотест 🤖.\n"
		+ "Я буду перевіряти чи вірно працюють функціональні частини додатку.\n\n"
		+ "Давай пройдемось за списком 📔\n",
	UNIT_TESTS: 'Спершу перевіримо unit тести:',
	CODE_STYLE: 'А тепер, глянемо на твій код:',
	CODE_STYLE_IS_NOT_GOOD: 'Щось твій код виглядає не дуже добре. Перевірь, будь-ласка, наступні файли:',
	CODE_STYLE_IS_GOOD: 'Чудово, твій код написаний згідно PSR-12, так тримати.',

	FINAL_WORDS: 'Ну що ж, ты набрав ${score} 🦜. І це ',
	BEST_RESULT: 'чудовий результат 🎉 ',
	GOOD_RESULT: 'непоганий результат 👍 Але є що покращити 🛠️',
	BAD_RESULT: 'так собі результат 🤷 Спробуй покращити якщо ще є час та спроби 🛠️',
	FINAL: 'Тепер чекай, коли Binarian перевірить твою роботу та поставить фінальну оцінку ☠️',

	REPORT_ERROR: 'Щось пішло не так 🛠️ Тестовий репорт не згенерувався.',
	CODE_STYLE_REPORT_ERROR: 'Щось пішло не так 🛠️ Code style репорт не згенерувався.',
	SOMETHING_WENT_WRONG: 'Щось пішло не так 🛠️',
};